renesas/rx-driver-package/source/r_mesh_rx23w/r_mesh_rx23w_vx.xx/r_mesh_rx23w/src/bearer/gatt_db_prov.c
    /* Handle - 0x0003 */
    /* 0 - DeviceName - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        21,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        22,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 5),
    },

    /* Handle - 0x0004 */
    /* 1 - Appearance - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        7,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 26),
    },

    /* Handle - 0x0005 */
    /* 1 - Appearance - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        2,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        24,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 31),
    },

    /* Handle - 0x0006 */
    /* 1 - GATT - Service Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        2,

        /* Next Attribute Type Index */
        10,

        /* UUID Offset */
        0,

        /* Value */
        (uint8_t *)(gatt_const_uuid_mesh_prov + 26),
    },

    /* Handle - 0x0007 */
    /* 2 - Service Changed - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        11,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 33),
    },

    /* Handle - 0x0008 */
    /* 2 - Service Changed - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        0,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        28,

        /* Value */
        NULL,
    },

    /* Handle - 0x0009 */
    /* 2 - Service Changed - CCD */
    {
        /* Property */
        BLE_GATT_DB_READ |
        BLE_GATT_DB_WRITE,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY |
        BLE_GATT_DB_PEER_SPECIFIC_VAL_PROPERTY,

        /* Value Length */
        2,

        /* Next Attribute Type Index */
        13,

        /* UUID Offset */
        12,

        /* Value */
        gatt_db_peer_specific_val_mesh_prov + 0,
    },

    /* Handle - 0x000A */
    /* 2 - Battery - Service Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        2,

        /* Next Attribute Type Index */
        15,

        /* UUID Offset */
        0,

        /* Value */
        (uint8_t *)(gatt_const_uuid_mesh_prov + 30),
    },

    /* Handle - 0x000B */
    /* 3 - BatteryLevel - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        16,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 38),
    },

    /* Handle - 0x000C */
    /* 3 - BatteryLevel - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        1,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        32,

        /* Value */
        gatt_value_mesh_prov + 0,
    },

    /* Handle - 0x000D */
    /* 3 - BatteryLevel - CCD */
    {
        /* Property */
        BLE_GATT_DB_READ |
        BLE_GATT_DB_WRITE,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY |
        BLE_GATT_DB_PEER_SPECIFIC_VAL_PROPERTY,

        /* Value Length */
        2,

        /* Next Attribute Type Index */
        39,

        /* UUID Offset */
        12,

        /* Value */
        gatt_db_peer_specific_val_mesh_prov + 2,
    },

    /* Handle - 0x000E */
    /* Characteristic 3 - BatteryLevel - Presentation Format */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        7,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        16,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 43),
    },

    /* Handle - 0x000F */
    /* 3 - DeviceInformation - Service Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        2,

        /* Next Attribute Type Index */
        34,

        /* UUID Offset */
        0,

        /* Value */
        (uint8_t *)(gatt_const_uuid_mesh_prov + 34),
    },

    /* Handle - 0x0010 */
    /* 4 - ManufacturerName - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        18,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 50),
    },

    /* Handle - 0x0011 */
    /* 4 - ManufacturerName - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        17,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        36,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 55),
    },

    /* Handle - 0x0012 */
    /* 5 - ModelNumber - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        20,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 72),
    },

