renesas/rx-driver-package/source/r_mesh_rx23w/r_mesh_rx23w_vx.xx/r_mesh_rx23w/src/bearer/gatt_db_prov.c
    /* Handle - 0x0013 */
    /* 5 - ModelNumber - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        9,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        38,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 77),
    },

    /* Handle - 0x0014 */
    /* 6 - SerialNumber - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        22,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 86),
    },

    /* Handle - 0x0015 */
    /* 6 - SerialNumber - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        40,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 91),
    },

    /* Handle - 0x0016 */
    /* 7 - FirmwareRevision - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        24,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 96),
    },

    /* Handle - 0x0017 */
    /* 7 - FirmwareRevision - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        42,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 101),
    },

    /* Handle - 0x0018 */
    /* 8 - HardwareRevision - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        26,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 106),
    },

    /* Handle - 0x0019 */
    /* 8 - HardwareRevision - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        44,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 111),
    },

    /* Handle - 0x001A */
    /* 9 - SoftwareRevision - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        28,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 116),
    },

    /* Handle - 0x001B */
    /* 9 - SoftwareRevision - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        46,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 121),
    },

    /* Handle - 0x001C */
    /* 10 - SystemId - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        30,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 126),
    },

    /* Handle - 0x001D */
    /* 10 - SystemId - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        8,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        48,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 131),
    },

    /* Handle - 0x001E */
    /* 11 - RegCertDataList - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        32,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 139),
    },

    /* Handle - 0x001F */
    /* 11 - RegCertDataList - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        32,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        50,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 144),
    },

    /* Handle - 0x0020 */
    /* 12 - PnPID - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        35,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 176),
    },

    /* Handle - 0x0021 */
    /* 12 - PnPID - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        7,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        52,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 181),
    },

    /* Handle - 0x0022 */
    /* 4 - Mesh Provisioning - Service Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        2,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        0,

        /* Value */
        (uint8_t *)(gatt_const_uuid_mesh_prov + 54),
    },

