renesas/rx-driver-package/source/r_mesh_rx23w/r_mesh_rx23w_vx.xx/r_mesh_rx23w/src/bearer/gatt_db_prov.c
    /* Handle - 0x0023 */
    /* 13 - Mesh Prov Data IN - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        37,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 188),
    },

    /* Handle - 0x0024 */
    /* 13 - Mesh Prov Data IN - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_WRITE_WITHOUT_RSP,

        /* Auxillary Property */
        BLE_GATT_DB_NO_AUXILIARY_PROPERTY,

        /* Value Length + Length Header Byte */
        (66 + 1),

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        56,

        /* Value */
        gatt_value_mesh_prov + 1,
    },

    /* Handle - 0x0025 */
    /* 14 - Mesh Prov Data OUT - Characteristic Declaration */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY,

        /* Value Length */
        5,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        6,

        /* Value */
        (uint8_t *)(gatt_const_value_mesh_prov + 193),
    },

    /* Handle - 0x0026 */
    /* 14 - Mesh Prov Data OUT - Characteristic Value */
    {
        /* Property */
        BLE_GATT_DB_READ,

        /* Auxillary Property */
        BLE_GATT_DB_NO_AUXILIARY_PROPERTY,

        /* Value Length + Length Header Byte */
        (66 + 1),

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        58,

        /* Value */
        gatt_value_mesh_prov + 68,
    },

    /* Handle - 0x0027 */
    /* 14 - Mesh Prov Data OUT - CCD */
    {
        /* Property */
        BLE_GATT_DB_READ |
        BLE_GATT_DB_WRITE,

        /* Auxillary Property */
        BLE_GATT_DB_FIXED_LENGTH_PROPERTY |
        BLE_GATT_DB_PEER_SPECIFIC_VAL_PROPERTY,

        /* Value Length */
        2,

        /* Next Attribute Type Index */
        BLE_GATT_DB_INVALID_ATTR_HANDLE_VAL_MESH_PROV,

        /* UUID Offset */
        12,

        /* Value */
        gatt_db_peer_specific_val_mesh_prov + 4,
    },

};


const st_ble_gatts_db_char_cfg_t gatt_char_mesh_prov[] =
{

    /* 0 - DeviceName */
    {
        {
            /* Number of attributes in characteristic including the definition */
            2,
        },

        /* Characteristic Start Handle */
        0x0002,

        /* Characteristic Service Index */
        0,
    },

    /* 1 - Appearance */
    {
        {
            /* Number of attributes in characteristic including the definition */
            2,
        },

        /* Characteristic Start Handle */
        0x0004,

        /* Characteristic Service Index */
        0,
    },

    /* 2 - Service Changed */
    {
        {
            /* Number of attributes in characteristic including the definition */
            3,
        },

        /* Characteristic Start Handle */
        0x0007,

        /* Characteristic Service Index */
        1,
    },

    /* 3 - BatteryLevel */
    {
        {
            /* Number of attributes in characteristic including the definition */
            4,
        },

        /* Characteristic Start Handle */
        0x000B,

        /* Characteristic Service Index */
        2,
    },

    /* 4 - ManufacturerName */
    {
        {
            /* Number of attributes in characteristic including the definition */
            2,
        },

        /* Characteristic Start Handle */
        0x0010,

        /* Characteristic Service Index */
        3,
    },

    /* 5 - ModelNumber */
    {
        {
            /* Number of attributes in characteristic including the definition */
            2,
        },

        /* Characteristic Start Handle */
        0x0012,

        /* Characteristic Service Index */
        3,
    },

    /* 6 - SerialNumber */
    {
        {
            /* Number of attributes in characteristic including the definition */
            2,
        },

        /* Characteristic Start Handle */
        0x0014,

        /* Characteristic Service Index */
        3,
    },

    /* 7 - FirmwareRevision */
    {
        {
            /* Number of attributes in characteristic including the definition */
            2,
        },

        /* Characteristic Start Handle */
        0x0016,

        /* Characteristic Service Index */
        3,
    },

    /* 8 - HardwareRevision */
    {
        {
            /* Number of attributes in characteristic including the definition */
            2,
        },

        /* Characteristic Start Handle */
        0x0018,

        /* Characteristic Service Index */
        3,
    },

    /* 9 - SoftwareRevision */
    {
        {
            /* Number of attributes in characteristic including the definition */
            2,
        },

        /* Characteristic Start Handle */
        0x001A,

        /* Characteristic Service Index */
        3,
    },

    /* 10 - SystemId */
    {
        {
            /* Number of attributes in characteristic including the definition */
            2,
        },

        /* Characteristic Start Handle */
        0x001C,

        /* Characteristic Service Index */
        3,
    },

    /* 11 - RegCertDataList */
    {
        {
            /* Number of attributes in characteristic including the definition */
            2,
        },

        /* Characteristic Start Handle */
        0x001E,

        /* Characteristic Service Index */
        3,
    },

    /* 12 - PnPID */
    {
        {
            /* Number of attributes in characteristic including the definition */
            2,
        },

        /* Characteristic Start Handle */
        0x0020,

        /* Characteristic Service Index */
        3,
    },

    /* 13 - Mesh Prov Data IN */
    {
        {
            /* Number of attributes in characteristic including the definition */
            2,
        },

        /* Characteristic Start Handle */
        0x0023,

        /* Characteristic Service Index */
        4,
    },

    /* 14 - Mesh Prov Data OUT */
    {
        {
            /* Number of attributes in characteristic including the definition */
            3,
        },

        /* Characteristic Start Handle */
        0x0025,

        /* Characteristic Service Index */
        4,
    },
};


