renesas/rx-driver-package/source/r_mesh_rx23w/r_mesh_rx23w_vx.xx/r_mesh_rx23w/src/bearer/gatt_db_prov.c
const st_ble_gatts_db_serv_cfg_t gatt_serv_mesh_prov[] =
{

    /* 0 - GAP */
    {
        {
            /* Number of attributes in Service */
            1,
        },

        /* Service Description */
        BLE_GATT_DB_SER_NO_SECURITY_PROPERTY,

        /* Service Start Handle */
        0x0001,

        /* Service End Handle */
        0x0005,

        /* Characteristic Start Index */
        0,

        /* Characteristic End Index */
        1
    },

    /* 1 - GATT */
    {
        {
            /* Number of attributes in Service */
            1,
        },

        /* Service Description */
        BLE_GATT_DB_SER_NO_SECURITY_PROPERTY,

        /* Service Start Handle */
        0x0006,

        /* Service End Handle */
        0x0009,

        /* Characteristic Start Index */
        2,

        /* Characteristic End Index */
        2
    },

    /* 2 - Battery */
    {
        {
            /* Number of attributes in Service */
            1,
        },

        /* Service Description */
        BLE_GATT_DB_SER_NO_SECURITY_PROPERTY,

        /* Service Start Handle */
        0x000A,

        /* Service End Handle */
        0x000E,

        /* Characteristic Start Index */
        3,

        /* Characteristic End Index */
        3
    },

    /* 3 - DeviceInformation */
    {
        {
            /* Number of attributes in Service */
            1,
        },

        /* Service Description */
        BLE_GATT_DB_SER_NO_SECURITY_PROPERTY,

        /* Service Start Handle */
        0x000F,

        /* Service End Handle */
        0x0021,

        /* Characteristic Start Index */
        4,

        /* Characteristic End Index */
        12
    },

    /* 4 - Mesh Provisioning */
    {
        {
            /* Number of attributes in Service */
            1,
        },

        /* Service Description */
        BLE_GATT_DB_SER_NO_SECURITY_PROPERTY,

        /* Service Start Handle */
        0x0022,

        /* Service End Handle */
        0x0027,

        /* Characteristic Start Index */
        13,

        /* Characteristic End Index */
        14
    },
};

st_ble_gatts_db_cfg_t g_gatt_db_table_mesh_prov =
{
    gatt_const_uuid_mesh_prov,
    gatt_value_mesh_prov,
    gatt_const_value_mesh_prov,
    gatt_db_peer_specific_val_mesh_prov,
    gatt_db_const_peer_specific_val_mesh_prov,
    gatt_type_mesh_prov,
    gatt_db_attr_mesh_prov,
    gatt_char_mesh_prov,
    gatt_serv_mesh_prov,
    ARRAY_SIZE(gatt_serv_mesh_prov),
    ARRAY_SIZE(gatt_char_mesh_prov),
    ARRAY_SIZE(gatt_type_mesh_prov),
    ARRAY_SIZE(gatt_db_peer_specific_val_mesh_prov),
};

